Repository: JNCote89/geoadaptation-production
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fr

source: The next sections explain in detail the technique used to better understand the subtleties and the results of the algorithm. Firstly, the data to predict, which are the daily hospitalizations link to COVID by Québec Health Regions, will be analyzed. Then, relevant variables at first sight, but not integrated to the algorithm, will be explained. The relevant variables selected will be justified, and the random forest performance will be analyzed. An example of a dynamic dashboard to interact with the built model will follow. Finally, a parallel with my research project on climate change is presented.
fr: Les prochaines sections expliquent en détail la technique utilisée pour mieux comprendre les subtilités et les résultats de l’algorithme. Dans un premier temps, les données à prédire, c’est-à-dire les hospitalisations quotidiennes liées à la COVID par région sociosanitaire, seront analysées. Ensuite, les variables pertinentes à première vue, mais non retenues pour être intégrées à l’algorithme, seront expliquées. Les variables retenues seront justifiées dans la section suivante, puis la performance du Random Forest sera analysée. Un exemple d’un tableau de bord dynamique permettant d’interagir avec le modèle construit suit. Enfin, un parallèle avec mon projet de recherche sur les changements climatiques est présenté.

source: The table of content below allow to jump from one section to another, and the arrow at the bottom right of the screen allow to scroll at the top of the page.
fr: La table des matières ci-dessous permet de sauter d’une section à l’autre et la flèche dans le bas à droite de l’écran permet de remonter en haut de la page.

source: Data to predict
fr: Données à prédire

source: Relevant variables not selected
fr: Variables intéressantes non retenues

source: Relevant variables selected
fr: Variables pertinentes retenues

source: Random forest performance analysis
fr: Analyse de la performance du Random Forest

source: Dashboard example
fr: Exemple de tableau de bord

source: Parallel with my research project on climate change
fr: Parallèle avec mon projet de recherche sur les changements climatiques

source: The daily hospitalization rates link to COVID available on
fr: Le taux d’hospitalisations quotidien lié à la COVID disponible sur

source: from April 10, 2020, to August 14, 2021, has been used for the 16 most populous Quebec Health Regions (Nunavik and Terres-Cris-de-la-Baie-James regions have been discarded, because their reality is totally different from the rest of the province). This represents 7872 observations for the algorithm (492 days x 16 regions).
fr: du 10 avril 2020 au 14 août 2021 a été utilisé pour les 16 régions sociosanitaires les plus populeuses (le Nunavik et les Terres-Cris-de-la-Baie-James ont été écartés, puisque leur réalité est totalement différente du reste du Québec). Cela représente 7872 observations pour l’algorithme (492 jours x 16 régions).

source: The daily hospitalization rates vary from 0 %% to 0,064 %% by region (number of hospitalization / region population * 100). To avoid choosing arbitrarily a number of class (such as quintile), the data distribution has been studied. The elbow method showed that 5 classes were appropriate for the data set. The Jenks Natural Breaks classification algorithm split the hospitalization levels like that:
fr: Les taux d’hospitalisations quotidiens variaient entre 0 %% et 0,064 %% par région (nombre d'hospitalisations / population de la région * 100). Afin d’éviter de choisir de façon arbitraire un nombre de classes (par exemple, par quintile), la distribution des données a été étudiée. La méthode du coude (elbow method) a permis de déterminer que 5 classes représentaient bien les données. L’algorithme de classification Jenks Natural Breaks a permis de séparer les niveaux d’hospitalisations ainsi :

source: <li>Level 1 : 0 to 0,0034 %% (4 738 region-days)</li> <li>Level 2 : 0,0035 to 0,010 %% (2175 region-days)</li> <li>Level 3 : 0,011 to 0,021 %% (758 region-days)</li> <li>Level 4 : 0,022 to 0,042 %% (166 region-days)</li> <li>Level 5 : 0,043 to 0,064 %% (35 region-days) </li>
fr: <li>Niveau 1 : 0 à 0,0034 %% (4 738 région-jours)</li> <li>Niveau 2 : 0,0035 à 0,010 %% (2175 région-jours)</li> <li>Niveau 3 : 0,011 à 0,021 %% (758 région-jours)</li> <li>Niveau 4 : 0,022 à 0,042 %% (166 région-jours)</li> <li>Niveau 5 : 0,043 à 0,064 %% (35 région-jours) </li>

source: Only the Montreal region has reached a level 5 hospitalization (35 days). The Saguenay-Lac-Saint-Jean (37 days), Montreal (87 days) and Laval (42 days) regions have reached a level 4 hospitalization during the pandemic. The Bas-Saint-Laurent, Abitibi-Témiscamingue, Côte-Nord, Nord-du-Québec and Gaspésie-Iles-de-la-Madeline regions have never exceeded the level 2.
fr: Seule la région de Montréal a atteint un niveau 5 d’hospitalisation (35 jours). Les régions du Saguenay-Lac-Saint-Jean (37 jours), de Montréal (87 jours) et de Laval (42 jours) ont atteint le niveau 4 au cours de la pandémie. Le Bas-Saint-Laurent, l’Abitibi-Témiscamingue, la Côte-Nord, le Nord-du-Québec et la Gaspésie-Iles-de-la-Madeleine n’ont jamais dépassé le niveau 2.

source: It would have been a lot more interesting to use more precise data (like by RLS or by dissemination areas) to get a wider diversity of observations, but they were not available to my knowledge in an open data access.
fr: Il aurait été beaucoup plus intéressant d’avoir des données plus précises (par RLS ou par aires de diffusion) pour avoir une plus grande diversité d’observations, mais elles n’étaient pas disponibles à ma connaissance sous format de données ouvertes.

source: It is crucial to understand the analyzed data set to understand the performance of the built algorithm. Since a region like Abitibi-Témiscamingue has never exceeded a level 2, we must not expect the algorithm to predict anything else above this level for this region. Machine learning and neural networks can recognize patterns that they have already observed. This subtlety must be understood to fully understand what we mean by prediction in the dashboard.
fr: Il est important de comprendre les données analysées pour comprendre la performance de l’algorithme développé. Puisqu’une région comme l’Abitibi-Témiscamingue n’a jamais dépassé le niveau 2, il ne faut pas se surprendre si l’algorithme ne prédit jamais un niveau plus élevé pour cette région. Les algorithmes d’apprentissage machine et de réseaux de neurones reconnaissent des schémas qu’ils ont déjà observés. Cette subtilité doit être bien comprise pour pleinement comprendre ce que l’on entend par prédiction dans le tableau de bord.

source: Many variables linked with the COVID-19 pandemic has been explored, but haven’t been selected for various reasons.
fr: Plusieurs variables en lien avec la pandémie de COVID-19 ont été explorées, mais n’ont pas été retenues pour diverses raisons.

source: First of all,
fr: Dans un premier temps, les

source: the public health measures listed on the INSPQ timeline
fr: mesures sanitaires répertoriées sur la ligne du temps par l'INSPQ

source: have been integrated to the first modelling attempts. However, many problems arose with this strategy. For instance, the mandatory mask wearing has been in effect for almost the whole pandemic, which led to a lack of observation without the measure for the algorithm to pick up on it.
fr: ont été intégrées aux premiers essais de modélisation. Cependant, il y avait plusieurs problèmes avec cette approche. Premièrement, certaines mesures comme le port du masque ont été en vigueur pendant presque toute la durée de la pandémie, ce qui occasionnait un manque d’observations sans la mesure pour que l’algorithme puisse tirer des conclusions.

source: Other measures, like the curfew, had no link with the hospitalization rate and the algorithm couldn’t integrate those parameters. At last, measures like shutting down retail stores were too well correlated with the hospitalization rate and was crushing every other variable in the model. Indeed, this measure was put in place when the government was fearing an overload in the hospital system. Therefore, this variable has been put aside, because an algorithm that can recognize a variable closely correlate to the studied phenomenon is useless. A human could just look at this variable and draw the same conclusion.
fr: D’autres mesures comme le couvre-feu n’avaient aucun lien avec les hospitalisations et l’algorithme n’arrivait pas à intégrer ces paramètres. Enfin, des mesures comme la fermeture des commerces étaient trop bien corrélées avec les hospitalisations et écrasaient toutes les autres variables dans le modèle. En effet, cette mesure était mise en place lorsque le gouvernement craignait un débordement des hôpitaux. Ainsi, cette variable a été mise de côté, car un algorithme qui reconnaît une variable étroitement corrélée au phénomène étudié ne sert à rien. Il suffit à un être humain de regarder ladite variable et de tirer ses propres conclusions.

source: The
fr: Le

source: daily number of confirmed cases
fr: nombre de cas confirmés quotidiens

source: would have been interesting, but since the open data couldn’t be retrieved on a historical basis by region, this avenue couldn’t be explored more.
fr: aurait pu être intéressant, mais puisque les données ouvertes ne permettent pas d’avoir un historique par région, cette avenue n’a pas été explorée.

source: rate of variants
fr: taux de variants

source: in circulation has also been analyzed, but there were too few observations in the model to be used by the algorithm for now.
fr: en circulation a aussi été analysé, mais il y avait trop peu d’observations dans le modèle pour que l’algorithme puisse l'utiliser pour l'instant.

source: Other data like the positivity rate or the effective reproduction number (Rt) would have been interesting as well, but historical data by regions were not available.
fr: Certaines données auraient aussi pu être intéressantes comme le taux de positivité ou le taux de reproduction (Rt), mais les données historiques par région n’étaient pas disponibles.

source: In order to evaluate the relevance of each variable, the
fr: Afin d’évaluer la pertinence des variables, la

source: SHAP value
fr: valeur SHAP

source: has been used. The higher the value, the bigger the contribution to the model. However, we can’t establish a causal link based on this, it only means that the variable is more or less significant in the final result for this model with those variables. A SHAP value doesn’t have an absolute meaning, it is relative to the other value in the model. Therefore, the selected variables have been the ones that were the most significant and had an impact on the F1-Score and the accuracy of the model. If a variable could be removed from the model without affecting the performance, it was not kept. A summary of the result is available in the picture below.
fr: a été retenue. Plus la valeur est élevée, plus la variable contribue au modèle. Cela ne veut pas dire forcément un lien de cause à effet, seulement que cette variable est plus ou moins significative dans le résultat final pour ce modèle avec ces variables. Une valeur SHAP n’a pas de signification absolue, elle est relative aux autres valeurs dans le modèle. Ainsi, les variables retenues ont été celles qui étaient les plus significatives et qui impactaient le F1-Score et la précision du modèle. Si une variable pouvait être retirée du modèle sans affecter la performance, elle n’était pas conservée. Un sommaire du résultat est disponible dans la figure ci-bas.

source: One of the most relevant variable in every model that was tried was the rate of social contact in the previous month based on the
fr: L'une des variables les plus pertinentes dans tous les modèles qui ont été essayés était le taux de contacts sociaux dans le dernier mois basé sur les données de

source: CONNECT study
fr: l'étude CONNECT.

source: data. It’s fairly logical to believe that an increase in social contacts lead to an increase of cases and the model follow that logic.
fr: Il est tout à fait logique de croire qu’une augmentation des contacts sociaux mène à une augmentation des cas infectieux et le modèle suit cette logique.

source: More than a hundred socioeconomic variables from the
fr: Plus d'une centaine de variables socioéconomiques du

source: Statistic Canada 2016 census
fr: recensement de Statistique Canada de 2016

source: has been tested. The various ages and income slices have not been a factor in this model. This can be easily explained. The number of observations was too small (16 regions) to integrate a large quantity of variables. This phenomenon is called the curse of dimensionality. Essentially, using more variables doesn’t lead to a better model if the number of observations is not substantial. For instance, if a model wishes to predict the colour of an object and that we have various sub classes (light blue, dark bleu, sky blue, etc.), the model will require a massive amount of observation for each subcategory of colour. To gather everything under the colour blue would be a better strategy in a context of limited data.
fr: ont été testées. Les différentes tranches d’âges ou de revenues n’ont pas été un facteur important dans le présent modèle. Cela peut s’expliquer aisément. Le nombre d’observations était trop petit (seulement 16 régions) pour intégrer une grande quantité de variables. Ce phénomène s’appelle le curse of dimensionality. Essentiellement, utiliser plus de variables n’est pas forcément mieux pour un modèle si le nombre d’observations n’est pas conséquent. Par exemple, si un modèle souhaite prédire la couleur d’un objet et que nous avons des dizaines de déclinaisons (bleu pâle, bleu foncé, bleu azur, etc.), le modèle va nécessiter une énorme quantité d’observations pour chaque sous-couleur. Tout rassembler sous la couleur bleue serait alors une meilleure stratégie dans un contexte de données limitées.

source: This is exactly what has been made in this model by taking the low income for the elderly of 65 years old and more. This variable reveals itself to be very significant. It’s logical to believe that the elderly are more vulnerable to the disease and that those with a low income are at a greater risk to be in an unfavourable environment.
fr: C’est exactement ce qui a été fait dans ce modèle en prenant la mesure de faibles revenues pour les 65 ans et plus. Cette variable s’est avérée très significative. Il est en effet logique de croire que les personnes âgées sont les plus vulnérables à la maladie et que ceux avec un faible revenue ont plus de chance d’être dans un environnement à risque.

source: The same logic applies for the recent immigration, since many first line or precarious workers are immigrants.
fr: La même logique a prévalu pour l’immigration récente, puisque plusieurs travailleurs de premières lignes ou de salariés précaires à risque sont des immigrants.

source: Finally, the vaccination rate also has an impact on the prediction, but less than what we could be led to believe. One of the reasons is the low number of observations for the high rate of a second dose (recent phenomenon in the pandemic history). For the first dose, it has obviously an impact, but the first waves have been mitigated without a high level of vaccination. Despite that, this variable remains relevant to create a dashboard that simulates various scenarios (high vaccination vs no vaccination). However, a small lack of accuracy is to be expected, since the volume of data was low overall. This phenomenon is quantified in the next section.
fr: Enfin, le taux de vaccination a également un impact sur la prédiction, mais moins que ce que l’on pourrait croire. L’une des raisons est que peu d’observations ont été faites avec un haut taux de 2e dose (phénomène récent dans l’historique pandémique). Pour ce qui est de la 1ere dose, elle a bien sûr un impact, mais les premières vagues ont été maîtrisées sans avoir un haut taux de vaccination. Néanmoins, cette variable demeure pertinente pour créer un tableau de bord qui englobe divers scénarios (haut taux de vaccination vs absence de vaccination). Il faut cependant s’attendre à quelques imprécisions dues au faible volume de données. Cette imprécision est quantifiée à la section suivante.

source: A neural network could have been used, but since my server is not very powerful, I rather feed my dashboard with a random forest that requires fewer computational resources once trained. However, for my PhD, a neural network will be used and will probably be more performing.
fr: Un réseau de neurones aurait pu être utilisé, mais puisque mon serveur n’est pas puissant, je préférais alimenter le tableau de bord avec un Random Forest qui est beaucoup moins demandant en ressource une fois entraînée. Cependant, pour mon projet de doctorat, un réseau de neurones sera utilisé et sera vraisemblablement plus performant.

source: The random forest (hyperparameters : 1024 trees, 3 minimum sample split, 1 minimum sample leaf) has been trained with 75 %% of the 7872 observations. The latter reached the accuracy of 91,6 %% and a F1-Score of 91,5 %% on the 25 %% test data.
fr: Le Random Forest (hyperparamètres : 1024 trees, 3 minimum sample splits, 1 minimum sample leaf) a été entraîné avec 75 %% des 7872 observations. Ce dernier a atteint une précision de 91,6 %% et un F1-Score de 91,5 %% sur les 25 %% de données tests.

source: Since the classes were heavily unbalanced, accuracy is not a reliable metric. Indeed, an algorithm that would always predict the dominant class could appear to perform well, but to be useless detecting anything other than the principal class. In this case, the F1-Score of 91,5 %%, which is the harmonic mean of the precision and the recall of each class, is interesting. Indeed, if only the dominant class would have been predicted, the F1-score would have been mediocre. The confusion matrix below shows an adequate performance for every class, without being exceptional. A lack of observations explains the ordinary performance for the high level of hospitalization.
fr: Puisque les classes sont fortement déséquilibrées, il ne faut pas se fier sur la précision. En effet, un algorithme qui prédit toujours la classe dominante peut apparaître performant, mais n’être d’aucune utilité pour détecter autre chose que la classe prépondérante. Dans le cas présent, le F1-Score de 91,5 %% qui est une moyenne harmonique de la précision et du rappel de chaque classe est intéressant. En effet, si seule la classe dominante avait été prédite adéquatement par l’algorithme, le F1-Score aurait été médiocre. La matrice de confusion ci-bas dénote une performance correcte pour l’ensemble des classes, sans être exceptionnelle. Un manque d’observation explique une performance ordinaire pour les niveaux élevés d’hospitalisations.

source: This dashboard has been designed with the limits stated in the previous sections. We must not focus too much on the accuracy of the prediction, but rather in its potential to generate maps depending on the different parameters. In this example, it is possible to modify for every region the vaccination rate and the social contacts in the last month by moving the sliders. To avoid inputting manually every possible scenario, buttons to randomize a range of data are available below the table. Once the desired values have been selected, you can launch the prediction by pushing on the predict button below the table.
fr: Ce tableau de bord a été conçu avec les limites énoncées dans les sections précédentes. Il ne faut pas trop se focaliser sur la précision de la prédiction, mais plutôt sur le potentiel de générer des cartes en fonction de différents paramètres. Pour cet exemple, il est possible de modifier pour chaque région les taux de vaccination et de contacts sociaux dans le dernier mois en déplaçant le curseur de défilement (slider). Afin d’éviter d’avoir à générer différents scénarios manuellement, des boutons qui génèrent un intervalle de données aléatoirement sont disponibles sous le tableau. Une fois les valeurs désirées sélectionnées, il suffit de lancer la prédiction en appuyant sur le bouton sous le tableau.

source: The result of the prediction is displayed on the map. You can click on a polygon to get the information that led to the prediction.
fr: Le résultat de la prédiction s’affiche sur la carte. Il est possible de cliquer sur le polygone de chaque région pour obtenir les informations qui ont mené à la prédiction.

source: First dose of vaccine (%%)
fr: Première dose de vaccin (%%)

source: Second dose of vaccine (%%)
fr: Deuxième dose de vaccin (%%)

source: Social contacts at home in the last month (%%)
fr: Contacts sociaux à domicile dans le dernier mois (%%)

source: Vaccination values
fr: Valeurs pour la vaccination

source: No vaccination
fr: Aucune vaccination

source: Low vaccination
fr: Faible vaccination

source: High vaccination
fr: Vaccination élevée

source: Social contact values
fr: Valeurs pour les contacts sociaux

source: Low social contacts
fr: Contacts sociaux faibles

source: High social contacts
fr: Contacts sociaux élevés

source: Values for the whole table
fr: Valeurs pour l'ensemble du tableau

source: Randomize data
fr: Données aléatoires

source: Launch prediction
fr: Lancer la prédiction

source: The problem with the COVID open data was the low number of observations to train the algorithm (only 16 regions and 492 days). Data by RLS or by dissemination areas would have produced more interesting results.
fr: Le problème avec les données ouvertes de COVID est le faible niveau d’observations pour entraîner l’algorithme (seulement 16 régions et 492 jours). L’accès aux données par RLS ou par aires de diffusion aurait produit des résultats plus intéressants.

source: The advantage of studying hospitalizations related to summer temperature data is its large number of observations in the last decades. Furthermore, this problematic is relatively consistent in its physiopathology. The current pandemic shows conditions that vary greatly from one wave to another (variants, vaccinations, etc.), which make it more complex for the algorithm to work.
fr: L’avantage d’étudier les hospitalisations en fonction des données de températures estivales réside dans son grand nombre d’observations dans les dernières décennies. De plus, cette problématique est relativement constante dans sa physiopathologie. La pandémie actuelle offre des conditions fort variables d’une vague à l’autre (variants, vaccinations, etc.), ce qui complexifie d’autant plus le travail de l’algorithme.

source: A dashboard on heat waves could integrate meteorological data with various temperature range, a simulator related to changing demographics (such as the proportion of elderly by sectors) or to vegetation cover changes by area. This approach has many advantages:
fr: Un tableau de bord sur les vagues de chaleur pourrait intégrer des données météorologiques avec des plages de températures variées, un simulateur en fonction de la démographie changeante (comme la proportion de personnes âgées par secteurs) ou bien en fonction du couvert végétal présent. Cette approche comporte plusieurs avantages :
