Repository: JNCote89/geoadaptation-production
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fr

source: <li>Production of many maps related to different parameters (vs a unique map of vulnerability).</li> <li>Since the AI produce a map that is based directly on the hospitalization and the mortality rates, the level of precision is higher. There is no lost information in a principal component analysis or debate to choose the variables and their weighting.</li> <li>Integrating a large number of variables with a non-linear relationship is possible if the number of observations is large enough.</li> <li>Possible to provide real time predictions to feed an alert system.</li> <li>Once the infrastructure is in place (I coded the whole website by myself with open-source software, it’s not costly, nor complex), the AI can constantly improve by learning every year with new data.</li> <li>A better understanding of the phenomenon can result of this strategy. Even if you can’t establish a causal link, patterns identify by the AI can show blind spots in the data that are not obvious at first sight.</li> <li>The same strategy can be applied to a good number of hazards (flooding, allergies, wild fires) if you adapt the relevant variables to select.</li>
fr: <li>Productions d’un grand nombre de cartes en fonction de différents paramètres (vs une carte unique générale de vulnérabilité)</li> <li>Puisque la carte produite par l’IA utilise directement des données d’hospitalisations et de mortalité, le niveau de précision est plus grand. Il n’y a pas de pertes d’information via une analyse en composante principale ou de débats pour choisir des variables et leur pondération.</li> <li>L’intégration d’un grand nombre de variables dont les relations ne sont pas forcément linéaires est possible si les observations sont suffisantes.</li> <li>Possibilité de fournir en temps réel des prédictions pour alimenter un système d’alerte. </li> <li>Une fois une infrastructure mise en place (j’ai codé tout le site web seul avec des logiciels libres, ce n’est ni très coûteux, ni très complexe), l’IA peut constamment s’améliorer en apprenant tous les ans avec de nouvelles données. </li> <li>Une meilleure compréhension des phénomènes peut en découler. Bien qu’on ne puisse pas effectuer de relations de cause à effet, les patrons identifiés par l’IA permettent d’approfondir certains angles qui pourraient être moins évidents de prime à bord. </li> <li>Le même principe peut s’appliquer pour un grand nombre d’aléas (inondations, allergies, feux de forêt) à condition d’adapter les variables pertinentes. </li>

source: Obviously, there are disadvantages and AI can’t replace traditional technic in epidemiology. This is not the goal, the objective of this project is to be complementary and offer an additional tool to public health. Among the disadvantages, we can underline:
fr: Il y a bien évidemment des désavantages et l’IA ne peut pas remplacer les techniques traditionnelles d’épidémiologie. Ce n’est d’ailleurs pas le but, l’objectif est d’être complémentaire et d’offrir un outil supplémentaire à la santé publique. Notons, entres autres :

source: <li>The algorithm can’t extrapolate data. For instance, a well-trained algorithm couldn’t have predicted exactly the number of deaths in absolute value in this summer’s British-Columbia heat wave. Since climate change will bring a lot of extreme events that have never been observed, only an order of magnitude can be provided. That being said, it’s true for any tool that tries to make predictions. AI has the advantage of being flexible and to integrate those new data quickly.</li> <li>Private life matters are very important to consider while implementing AI-based solutions. My methodology only uses population-based data and don’t use data that can identify individuals, which increase the adhesion of the population to this type of solution.</li> <li>To my knowledge, very few researches are made to create vulnerability map base on AI and GIS. Most of the scientific literature rely on principal component analysis or consider only one aspect of the problem at the time. More research is needed to fully evaluate the potential of this approach in a climate change context.</li>
fr: <li>L’algorithme ne peut pas extrapoler des données. Par exemple, un algorithme bien entraîné n’aurait pas pu prédire adéquatement le nombre de morts en valeur absolue dans l’importante vague de chaleur que la Colombie-Britannique a vécu cet été. Puisque les changements climatiques apporteront des évènements extrêmes qui n’ont jamais été observés, seul un ordre de grandeur peut être fourni. Ceci étant dit, cela demeure vrai pour n’importe quel outil qui tente d’effectuer des prédictions. L’IA possède l’avantage d’être flexible et d’intégrer rapidement ces nouvelles données. </li> <li>La notion de vie privée est très importante à considérer dans une éventuelle implantation d’une solution basée sur l’IA. Ma méthodologie évalue les données au niveau populationnel et n’utilise pas de données qui permettent d’identifier des individus, ce qui augmente l’adhésion de la population à ce type de solution. </li> <li>À ma connaissance, très peu de recherches sont effectuées pour créer des cartes de vulnérabilités basées sur l’IA et les SIG. La majorité de la littérature scientifique semble s’appuyer sur les analyses en composante principale pour le moment ou ne considérer qu’un seul aspect à la fois. Plus de recherches sont nécessaires pour pleinement évaluer le potentiel de cette approche en contexte de changements climatiques. </li>

source: Research projects overview
fr: Aperçu des projets de recherche

source: My primary fields of research are public health and climate change. I am interested in leveraging the power of geographic information systems (GIS) and artificial intelligence to help improve the assessment of vulnerability. The question of vulnerability is very important, because this concept is at the core of creating adaptation plans. Indeed, to make sure we invest at the right place and that we get the best return on our investments, it is fundamental to use a good framework. </p> <p> During my master’s in environment, I wrote an
fr: Mes principaux champs de recherche sont la santé publique et les changements climatiques. Je souhaite exploiter la puissance des systèmes d’information géographique et de l’intelligence artificielle pour aider à améliorer le calcul de la vulnérabilité. Cette problématique est très importante, car ce concept est au cœur de la création des plans d’adaptation. En effet, pour s’assurer d’investir au bon endroit et d’obtenir le meilleur retour sur notre investissement, il est fondamental d’utiliser une bonne structure d’analyse. </p> <p> Pendant ma maîtrise en environnement, j’ai rédigé un

source: essay
fr: essai

source: to better grasp the concept of vulnerability. That led to the
fr: pour mieux comprendre le concept de vulnérabilité. Ce travail a mené à la création du

source: Magog climate change adaptation plan
fr: plan d'adaptation aux changements climatiques pour la Ville de Magog

source: and a project on
fr: et d'un projet de

source: monitoring an urban heat island in Magog.
fr: suivi des ilots de chaleur à Magog.

source: </p> <p> However, I am not fully satisfied with the tools we currently have to assess vulnerability and that’s why I’m working on a PhD project to improve the general approach (more details to come).
fr: </p> <p> Cependant, je ne suis pas pleinement satisfait avec les outils que nous possédons pour calculer la vulnérabilité et c’est la raison pour laquelle je travaille sur un projet de doctorat afin d’améliorer cette démarche (plus de détails à venir).

source: Magog, Université de Sherbrooke, tutorial, GIS, artificial intelligence, python, Django, LoraWan, LoRa, MQTT
fr: Magog, Université de Sherbrooke, tutoriel, SIG, intelligence artificielle, python, Django, LoraWan, LoRa, MQTT

source: Overview of research projects.
fr: Aperçu des projets de recherche

source: Tutorials overview
fr: Aperçu des tutoriels

source: I made a few tutorials to help other students and those who are starting in the field of geographic information systems (GIS). I am by no means a software engineer and I do not claim that my code or solutions are the cleanest. However, I have spent countless hours figuring out how all this could work together. There are not a lot of resources online to help GIS professional. I also found the example for Django rather basics which make it difficult to figure out more advanced stuff if you are not a web developer. </p> <p> In my
fr: J’ai créé quelques tutoriels pour aider d’autres étudiants et ceux qui débutent dans le domaine des SIG. Je ne suis en aucun cas un ingénieur logiciel et je ne prétends pas que mon code et mes solutions sont optimaux. Par contre, j’ai passé plusieurs heures à comprendre comment tout ça pouvait fonctionner ensemble. Il n’y a pas beaucoup de ressources en ligne pour aider les professionnels en SIG. De plus, j’ai trouvé les exemples pour Django plutôt de base, ce qui rendait difficile la compréhension des trucs plus avancés lorsqu’on n’est pas un développeur web. </p> <p> Dans mon

source: Django for GIS tutorials
fr: tutoriel Django pour les projets SIG

source: I mainly cover how to create a dashboard with widgets and a map with interpolate temperature layers in it using Folium, Scipy and Matplotlib. You can see the result in the section on
fr: je couvre principalement comment créer un tableau de bord avec des widgets et une carte avec des couches de températures interpolées en utilisant Folium, Scipy et Matplolib. Le résultat est dans la section

source: urban heat islands monitoring at the Espace Saint-Luc in Magog
fr: suivi des ilots de chaleur à l'Espace Saint-Luc à Magog

source: I also add a few tips on part where I struggled, such as how to make a bilingual site and I few things that I took probably way too much time to figure out on my own, such as how Ajax and Django work together. However, I’m not going through the basic stuff, as other do it way better than I could. I will only reference sources I found interesting. </p> <p> I also cover a bit the
fr: J’ai aussi ajouté des conseils sur les parties où j’ai rencontré des difficultés, comme sur la façon de créer un site bilingue et d’autres aspects que j’ai probablement pris beaucoup trop de temps à trouver par moi-même, comme le fonctionnement d’Ajax avec Django. Par contre, je ne passe pas en revue les bases, puisque plusieurs autres personnes le font beaucoup mieux que moi. Je vais seulement mettre des liens vers les références que je trouve pertinentes. </p> <p>Je couvre aussi un peu la technologie

source: technology to sample real-time data. Again, I am not an expert on those topics, but I have learned a few lessons by trial and error. If you happen to be an expert or just better than me with those technologies and programming in general, feel free to
fr: pour échantillonner des données en temps réel. Je ne suis pas un expert sur le sujet, mais j’ai appris quelques leçons par essais et erreurs. </p> <p> Si vous êtes un expert ou juste meilleur que moi avec ces technologies et la programmation en général, n’hésitez pas à

source: contact me
fr: me contacter

source: I will improve those sections based on your comments to help everyone who is facing those challenges. You can also contact me if you have questions regarding the content that would be unclear to you.
fr: Je vais améliorer ces sections en fonction de votre rétroaction pour en faire profiter tous ceux qui doivent affronter les mêmes défis. Vous pouvez aussi me contacter si vous avez des questions sur des sections qui ne sont pas claires pour vous.

source: Summary and full master's essay on vulnerability
fr: Sommaire et rapport complet de mon essai sur la vulnérabilité

source: Vulnerability assesment essay
fr: Essai sur le calcul de la vulnérabilité

source: This essay has been completed under the supervision of
fr: Cet essai a été complété sous la supervision de

source: from Bishop’s University for my master’s in environment at the Université de Sherbrooke.
fr: de l'Université Bishop's pour ma maîtrise en environnement à l'Université de Sherbrooke.

source: In order to decrease the deleterious impacts of climate change on vulnerable communities, it is essential to well quantify this phenomenon to adopt the appropriate strategies. A lot of adaptation plans to climate change rely on matrices to establish vulnerability, but those are succinct and lack precision. This assessment can be optimized with an approach that combines geographic information systems and a principal component analysis. The heat wave hazard and its consequences on public health has been chosen to study the equation V&nbsp=&nbspS&nbsp–&nbspAC, where V is the vulnerability, S the sensitivity and AC the adaptive capacity. </p> <p> This essay has developed a vulnerability assessment based on 14 sensitivity indicators split into 4 components that are weighted. The results are grouped by the Jenks Natural Breaks method. The adaptive capacity is based on a general equation that combine sensitivity indicators and their impact on the community. This approach has been compared to the Atlas de la vulnérabilité, a project by Université Laval researchers. Their method relies on 13 indicators of sensitivity split in 4 components that are not weighted. The results are grouped by the quintile method. The adaptive capacity is based on 7 indicators split in 2 components. </p> <p> Unfortunately, the lack of evidence-based data complicated the concept of a standard equation. Therefore, due to a lack of clear relationship between mortality, morbidity and various indicators of vulnerability, it is impossible to underline an optimal approach. It is recommended for most organizations that create adaptation plans to rely on the Atlas de la vulnérabilité, because it’s a turnkey solution with a solid scientific basis. For those who need a personalize assessment, an exhaustive approach is proposed. Finally, some food for thought is proposed to researchers to deepen the knowledge on vulnerability assessment that relies on expert opinion or studies with limited statistical power. </p> <p> Notwithstanding those obstacles, it remains a priority that politicians and managers act quickly in regard to public health and climate change by adopting no-regret strategies. The absence of a non-equivocal scientific literature is not a pretext for inaction.
fr: Afin d’atténuer les impacts délétères des changements climatiques sur les communautés vulnérables, il est essentiel de bien quantifier le phénomène pour adopter les stratégies appropriées. De nombreux plans d’adaptation aux changements climatiques s’appuient sur des matrices pour établir la vulnérabilité, mais ces dernières sont sommaires et manquent de précision. Cette évaluation peut être optimisée avec une approche qui combine les systèmes d’information géographique et une analyse en composante principale. L’aléa des vagues de chaleur et ses conséquences sur la santé publique a été choisi pour étudier l’équation V = S - CA, où V est la vulnérabilité, S la sensibilité et CA la capacité d’adaptation (ou la capacité à faire face).</p> <p> Le présent essai a développé un calcul de vulnérabilité avec 14 indicateurs de sensibilité divisés en 4 composantes qui sont pondérées. Les résultats sont regroupés par la méthode du Jenks Natural Breaks. La capacité d’adaptation se base sur une équation générale qui lie les indicateurs de sensibilité et leurs impacts sur la communauté. Cette approche a été comparée avec celle de l’Atlas de la vulnérabilité, un projet conçu par des chercheurs de l’Université Laval. Leur méthode repose sur 13 indicateurs de sensibilité divisés en 4 composantes qui ne sont pas pondérées. Les résultats sont regroupés par la méthode des quintiles. La capacité à faire face se base sur 7 indicateurs qui sont divisés en 2 composantes. </p> <p>Malheureusement, le manque de données probantes complexifie la conception d’un calcul standardisé. Ainsi, en l’absence d’une relation claire entre la mortalité, la morbidité et les divers indicateurs de la vulnérabilité, il est impossible de déterminer une approche optimale. Il est recommandé pour la majorité des organisations qui élaborent des plans d’adaptation de se fier à l’Atlas de la vulnérabilité, puisque c’est un outil clé en main avec une solide base scientifique. Pour celles qui nécessitent un calcul personnalisé, une démarche exhaustive est proposée. Enfin, des pistes de réflexion sont lancées aux chercheurs afin d’approfondir les connaissances sur les équations de vulnérabilité qui reposent principalement sur des avis d’experts et des études avec une puissance statistique limitée. </p> <p> Nonobstant ces obstacles, il demeure primordial que les politiciens et les gestionnaires agissent rapidement à l’égard de la santé publique et des changements climatiques, notamment en adoptant des mesures de type « sans regret ». L’absence d’une littérature scientifique sans équivoque ne saurait être un prétexte à l’inaction.

source: A big thanks to every teachers at the CUFE and at Bishop's microprogram on climate change, as well as everyone who works there. This essay would not have been possible without their tremendous support.
fr: Un gros merci à tous les enseignants du CUFE et du microprogramme sur les changements climatiques de l'Université Bishop's, ainsi qu'à tous ceux qui y travaillent. Cet essai n'aurait pas été possible sans leur immense soutien.
