Repository: JNCote89/geoadaptation-production
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fr

source: Interpolation scale for temperature
fr: Échelle d'interpolation des températures

source: No data for this day, please select another one
fr: Aucune donnée pour cette journée, SVP en choisir une autre

source: Legend
fr: Légende

source: Hospitalization level 1
fr: Niveau d'hospitalisation 1

source: Hospitalization level 2
fr: Niveau d'hospitalisation 2

source: Hospitalization level 3
fr: Niveau d'hospitalisation 3

source: Hospitalization level 4
fr: Niveau d'hospitalisation 4

source: Hospitalization level 5
fr: Niveau d'hospitalisation 5

source: Region
fr: Région

source: Hospitalization level
fr: Niveau d'hospitalisation

source: First dose
fr: Première dose

source: Second dose
fr: Deuxième dose

source: Social contacts
fr: Contacts sociaux

source: Low incomes (65 years old +)
fr: Faibles revenus (65 ans et +)

source: Recent immigration
fr: Immigration récente

source: Hourly maximum temperature on {date}
fr: Température horaire maximum pour le {date}

source: Hourly average temperature on {date}
fr: Température horaire moyenne pour le {date}

source: Time
fr: Heure

source: Daily maximum temperature on {year}-{month}
fr: Température quotidienne maximum pour le {month}-{year}

source: Daily average temperature on {year}-{month}
fr: Température quotidienne moyenne pour le {month}-{year}

source: Day
fr: Jour

source: Email
fr: Courriel

source: Subject
fr: Sujet

source: To avoid any spamming of my inbox, only 3 messages can be sent per hour per user based on your IP address. Thank you for your comprehension.
fr: Pour éviter le spamming de ma boîte courriel, seulement 3 messages par heure peuvent être envoyés par usager basé sur l'adresse IP. Merci de votre compréhension.

source: Home
fr: Accueil

source: CCAP
fr: PACC

source: Magog_ccap
fr: Magog_pacc

source: Research
fr: Recherche

source: Magog_uhi
fr: Magog_idc

source: Vulnerability_essay
fr: Essai_vulnerabilite

source: Tutorials
fr: Tutoriels

source: LoRa_tutorial
fr: Tutoriel_LoRa

source: Django_tutorial
fr: Tutoriel_Django

# url
source: About
fr: A_propos

# url
source: Email_sent
fr: Courriel_envoye

source: Proof_concept_COVID
fr: Preuve_concept_COVID

source: geoadaptation, climate change, vulnerability, sensitivity, adaptive capacity, adaptation, geomatics, GIS, public health, artificial intelligence, AI, python, Django
fr: géoadaptation, changements climatiques, vulnérabilité, sensibilité, capacité d'adaptation, adaptation, SIG, santé publique, intelligence artificielle, IA, python, Django

source: About section on the author of geoadaptation.ca
fr: Section à propos de l'auteur du geoadaptation.ca

source: About
fr: À propos

source: My name is Jean-Nicolas and I am a former pharmacist who graduates from
fr: Mon nom est Jean-Nicolas et je suis un ancien pharmacien qui a gradué de

source: Université Laval
fr: l'Université Laval

source: and works as a community pharmacist for 5 years. My curiosity and my passion for environment and public health led me to complete the
fr: et qui a travaillé comme pharmacien communautaire pendant 5 ans. Ma curiosité et ma passion pour l'environnement et la santé publique m'ont mené à compléter le

source: graduate microprogram in climate change at Université Laval
fr: microprogramme de deuxième cycle sur les changements climatiques de l'Université Laval

source: as well as a
fr: ainsi que la

source: master’s in environmental management and climate change at Université de Sherbrooke
fr: maîtrise en gestion de l'environnement et des changements climatiques de l'Université de Sherbrooke

source: that includes the
fr: qui inclut le

source: graduate microprogram in climate change at Bishop’s University
fr: microprogramme sur les changements climatiques de l'Université Bishop's

source: </p> <p> I am currently studying at the
fr: </p> <p> J'étudie présentement au

source: apply geomatics department of Université de Sherbrooke
fr: département de géomatique appliquée de l'Université de Sherbrooke

source: where I try to improve vulnerability assessment on climate change with artificial intelligence and geographic information systems. </p> <p> You can follow me on
fr: où j'essaie d'améliorer le calcul de la vulnérabilité aux changements climatiques avec l'intelligence artificielle et les systèmes d'information géographique. </p> <p> Vous pouvez me suivre sur

source: to get the latest news about my projects or get in touch. I only work with governmental and nonprofit organizations.
fr: pour avoir les dernières nouvelles sur mes projets ou pour me rejoindre. Je travaille seulement avec des organisations gouvernementales ou sans but lucratif.

source: Contact me
fr: Me contacter

source: The contact form requires JavaScript to work for security reasons. Contact me via LinkedIn if you don't want or can't turn it on.
fr: Ce formulaire requiert JavaScript pour fonctionner pour des raisons de sécurité. Contactez-moi via LinkedIn si vous ne voulez ou ne pouvez pas l’activer.

source: Send
fr: Envoyer

source: <h6>Image credit</h6> <p > <ul> <li>External sites: Nasa Images (Tutorial header), Pixabay - Suju-foto (About header)</li> <li>Additionnal images: Jean-Nicolas Côté, Sarah Dubord-Fortin</li> </ul> </p>
fr: <h6>Crédit pour les images</h6> <p > <ul> <li>Sites externes : Nasa Images (Entête Tutoriels), Pixabay - Suju-foto (Entête À propos)</li> <li>Images additionnelles : Jean-Nicolas Côté, Sarah Dubord-Fortin</li> </ul> </p>

source: en
fr: fr

source: The navbar is optimized to work with JavaScript via Bootstrap. However, you can still navigate through the site with the hyperlinks provide in each section overview.
fr: La barre de navigation est optimisée pour fonctionner avec JavaScript via Bootstrap. Par contre, il est possible de naviguer dans tout le site avec les hyperliens dans chaque aperçu des sections.

source: Geo
fr: Géo

source: Magog's climate change adaptation plan (CCAP)
fr: Plan d'adaptation aux changements climatiques (PACC) de Magog

source: Urban heat islands monitoring at Espace Saint-Luc in Magog
fr: Suivi des ilots de chaleur à l'Espace Saint-Luc de Magog

source: Master's essay on heat waves vulnerability assesment
fr: Essai de maîtrise sur le calcul de la vulnérabilité aux vagues de chaleur

source: PhD project with AI and GIS for public health
fr: Projet de doctorat avec l'IA et les SIG pour la santé publique

source: Django for GIS projects tutorial
fr: Tutoriel Django pour des projets SIG

source: LoRa, LoRaWan and MQTT
fr: LoRa, LoRaWan et MQTT

source: Language
fr: Langue

source: Magog, Université de Sherbrooke, climate change, vulnerability, sensitivity, adaptive capacity, adaptation, geoadaptation, geomatics, GIS, public health, adaptation plan
fr: Magog, Université de Sherbrooke, changement climatique, vulnérabilité, sensibilité, capacité d'adaptation, adaptation, géoadaptation, géomatique, SIG, santé publique, plan d'adaptation

source: Overview of the climate change adaptation plan section.
fr: Aperçu de la section plan d'adaptation aux changements climatiques

source: Climate change adapation plans (CCAP)
fr: Plans d'adaptationa aux changements climatiques

source: Climate change adaptation plans (CCAP)
fr: Plans d'adaptation aux changements climatiques (PACC)

source: CCAP overview
fr: Aperçu de la section PACC

source: Climate change adaptation plans (CCAP) are essential to be ready for what is to come in the next decades. Unfortunately, these require a lot of monetary and human resources to be individualized on a regional scale.
fr: Les plans d’adaptation aux changements climatiques (PACC) sont essentiels pour se préparer à ce qui s’en vient dans les prochaines décennies. Malheureusement, ceux-ci nécessitent beaucoup de ressources financières et humaines pour être individualisés à une échelle régionale.

source: Magog's climate change adaptation plan
fr: plan d'adaptation aux changements climatiques de Magog

source: is a good place to start to initiate the reflexion. However, this one is far from perfect and more research is needed to improve this approach, especially the vulnerability assessment and the quantification of the adaptive capacity. </p> <p> My
fr: est un bon début pour amorcer la réflexion. Cependant, ce dernier est loin d’être parfait et plus de recherches sont nécessaires pour améliorer la démarche, notamment pour le calcul de la vulnérabilité et la quantification de la capacité d’adaptation. </p> <p> Mon

source: master's essay
fr: essai de maîtrise

source: helps to familiarize with those notions and understand the challenge to assess vulnerability. I am currently working on a PhD that combines artificial intelligence and geographic information systems (GIS) (more details to come). </p> <p> However, a few universal findings came out of this approach. The <span class="h-text">protection of natural environments</span> and <span class="h-text">green infrastructure</span> are <span class="h-text">no regrets strategies</span> that are essential to successfully adapt. Indeed, the benefits of ecosystem services render by <span class="h-text">a healthy biodiversity</span> confer the best cost-effective ratio in the long run. </p>
fr: aide à se familiariser avec ces notions et à comprendre les défis du calcul de la vulnérabilité. Je travaille actuellement sur un projet de doctorat qui combine l’intelligence artificielle et les systèmes d’information géographique (SIG) afin de mieux définir la vulnérabilité (plus de détails à venir). </p> <p> Néanmoins, des constats universels se dégagent de cette démarche. La <span class="h-text">protection des milieux naturels </span> et les <span class="h-text">infrastructures vertes</span> sont des <span class="h-text">stratégies sans regret</span> essentielles pour réussir à s’adapter. En effet, les bénéfices des services écosystémiques rendus par <span class="h-text">une biodiversité en santé</span> confèrent le meilleur ratio coût-bénéfice à long terme. </p>

source: <p> A deep reflexion is essential in regards of territory planning that are generally led by immediate monetary consideration. If this strategy offers a short-term illusion of progress, it has been proven extremely harmful in the long term. We only need to look at all the current problems of urban heat islands, erosion and floods, as well as the bad quality of water and air in our cities that result of planning mistakes from the 20th century. </p> <p> It is imperative that we escape this logic if we want to have a chance to adapt to a climate that has nothing to do with the last century.
fr: <p> Une profonde réflexion s’impose quant au développement du territoire, ce dernier étant généralement mené par des considérations financières immédiates. Si cette stratégie offre une illusion de progrès à court terme, elle a été prouvée extrêmement néfaste à long terme. Il suffit de constater toutes les problématiques d’ilots de chaleur, d’érosion et d'inondations, ainsi que de la mauvaise qualité de l’eau et de l’air des villes qui découlent des erreurs de développement du 20e siècle. </p> <p> Il est impératif de sortir de cette logique si l’on souhaite avoir une chance de s’adapter à un climat qui n’aura rien à voir avec le siècle dernier.

source: Django, Python, Matplotlib, Scipy, Numpy, GIS, Folium
fr: Django, Python, Matplotlib, Scipy, Numpy, SIG, Folium

source: Tutorial on how to create a GIS dashboard with Django and Folium.
fr: Tutoriel sur comment créer des tableaux de bord SIG avec Django et Folium.

source: I am not going to go through the basics of Django and Python, since there are people way more qualify than me to do this. </p> <p> If you are completely new to programming in general, I strongly recommend you take a look at
fr: Je ne vais pas repasser les bases de Django et Python, puisqu'il y a des gens beaucoup plus qualifiés que moi pour le faire. </p> <p> Si vous êtes nouveaux dans le monde de la programmation en général, je recommande fortement de jeter un coup d'oeil au site web

source: website. He has some of the best tutorials on basic programming in different languages and a very nice introduction series to Django. I am not affiliated with him in any way, I just enjoyed its tutorials in my journey to improve my skills as a self-taught coder. </p> <p> Another nice resource is the
fr: Il propose d'excellents tutoriels sur les bases de la programmation dans différents langages et une série d'introduction à Django très bien faite. Je ne suis pas affilié à lui d'aucune façon, j'ai seulement apprécié ses tutoriels dans mon périple de programmeur autodidacte. </p> <p> Une autre bonne ressource est le site web

source: website that targets Django specifically. It helped me to better understand how to deploy my website using Nginx and Gunicorn. </p> <p> Obviously, it goes without saying that you should absolutely read the
fr: qui cible spécifiquement Django. Ce dernier m'a aidé à mieux comprendre comment déployer mon site web en utilisant Nginx et Gunicorn. </p> <p> Évidemment, il va sans dire que vous devriez absolument lire la

source: official documentation
fr: documentation officielle

source: There is also the
fr: Il y a aussi le site web

source: website from one of the Board Members of the Django Software Foundation.
fr: de l'un des membres du conseil d'administration de la fondation Django.

source: I am a bit short on time right now, so I don't have time to write an extensive tutorial (but it will come!). In the meantime, you can have a look at my
fr: Un tutoriel plus détaillé sera disponible prochainement lorsque j'aurai plus de temps. En attendant, vous pouvez regarder mon

source: I have tried to put as many comments as I could in each file, but I acknowledged that a Django project is overwhelming when you don't know where to start. I'll try to write the tutorial as soon as possible.
fr: J'ai essayé de mettre le plus de commentaires possibles dans chaque fichier, mais je sais qu'un projet Django peut être intimidant lorsqu'on ne sait pas par où commencer. J'essaierai de rédiger ce tutoriel le plus tôt possible.

source: Geoadaptation
fr: Géoadaptation

source: Email sent confirmation
fr: Confirmation de courriel envoyé

source: Email sent
fr: Courriel envoyé

source: Thank you for your message. Your email has been transmitted successfully. I'll try to get in touch with you as soon as possible.
fr: Merci pour votre message. Votre courriel s'est bien rendu à destination. Je vais essayer de vous répondre dans les plus brefs délais.

source: Magog, Université de Sherbrooke, Bishop's University, climate change, vulnerability, sensitivity, adaptive capacity, adaptation, geoadaptation, geomatics, GIS, public health, heat waves, hazards, artificial intelligence, python, Django, Folium, Matplotlib, LoRa, LoRaWan, MQTT, The Thing Stack, The Thing Network
fr: Magog, Université de Sherbrooke, changement climatique, vulnérabilité, sensibilité, capacité d'adaptation, adaptation, géoadaptation, géomatique, SIG, santé publique, plan d'adaptation

source: Geoadaptation.ca is a collection of projects and tutorials related to climate change and geographic information systems (GIS).
fr: Le geoadaptation.ca est un regroupement de projets et de tutoriels liés aux changements climatiques et aux systèmes d'information géographique (SIG)

source: Where
fr: Où la

source: geomatics
fr: géomatique

source: meet climate change
fr: rencontre l'

source: Available resources
fr: Ressources disponibles

source: Research on climate change adaptation and vulnerability
fr: Recherche sur l'adaptation et la vulnérabilité aux changements climatiques

source: Tutorials on geographic information system (GIS) and related technologies
fr: Tutoriels sur les systèmes d'information géographique (SIG) et les technologies connexes

source: About me and contact info
fr: À propos de moi et coordonnées

source: This project is guided by the <span class="h-text">open source</span> and <span class="h-text">open science</span> spirit. The fight against climate change must intensify if we want to mitigate its consequences on our communities. </p> <p> Therefore, <span class="h-text">collaboration</span> and <span class="h-text">knowledge sharing</span> is primordial to overcome all the challenges the future has in store for us and the following generations. </p> <p> This website is a step in this direction to help students, researchers, professionals, citizens and policy makers to make <span class="h-text">well-informed decisions</span> regarding climate change and the stakes surrounding it.
fr: Ce projet est dans l’esprit de la <span class="h-text">science et des logiciels libres</span>. La lutte aux changements climatiques doit s’intensifier si nous voulons parvenir à atténuer ses conséquences sur nos communautés. Ainsi, la <span class="h-text">collaboration</span> et le <span class="h-text">partage des connaissances</span> se révèlent primordiaux pour surmonter tous les défis que l'avenir réserve aux générations actuelles et futures. </p> <p> Ce site Web est un pas dans cette direction et a pour objectif d'aider les étudiants, les chercheurs, les professionnels, les citoyens et les décideurs à prendre des <span class="h-text">décisions éclairées</span> en lien avec les changements climatiques et les enjeux qui les entourent.

source: This website is a personal project financed and maintained by
fr: Ce site Web est un projet personnel financé et maintenu par

source: me
fr: moi

source: The financing and the support from different nonprofit organizations are clearly stated at the bottom of every project, if applicable.
fr: Le financement et le support des différentes organisations à but non lucratif sont clairement énoncés au bas de chaque projet, si applicable.

source: LoRa, LoRaWan, MQTT, The Thing Stack, TTS, The Thing Network, TTN, temperature, humidity, sensors, gateway, postgreSQL
fr: LoRa, LoRaWan, MQTT, The Thing Stack, TTS, The Thing Network, TTN, température, humidité, capteurs, passerelle, postgreSQL

source: Tutorial on how to set up a LoRa networks from the sensors to the database using MQTT protocol.
fr: Tutoriel sur comment installer un réseau LoRa des capteurs jusqu'à la base de données en utilisant le protocole MQTT.

source: LoRa tutorial
fr: Tutoriel LoRa

source: <p> I am a bit short on time right now, so I don't have time to write an extensive tutorial (but it will come!). In the meantime, here are a couple of key points that I learned by trials and errors: <ul> <li> Buildings make a huge difference on your range. Even if it says it can go a few kilometres in the open, don't expect more than 500 metres in an urban setting in the best case scenario. </li> <li> Concrete or brick buildings have a significant impact on the range as well. Some of my sensors can't reach more than 200 metres because of brick walls in the way. By opposition, my best range is 450 metres with a direct line of sight through a window. Knowing this, an outdoor gateway with a roof access might be your best bet to have a good 360 degrees range. </li> <li> If you are near a workplace that uses radio to communicate (like the public works building in Magog City), it can mess badly with the signal. This is the reason why on workdays between 7&nbspAM to 5&nbspPM, my readings are inconsistent. I am currently working on a solution to fix this. </li> </ul> </p>
fr: <p> Je manque de temps en ce moment, alors je n'ai pas le temps d'écrire un tutoriel détaillé (mais cela va venir!). En attendant, voici quelques éléments clés que j'ai appris à travers mes essais et erreurs: <ul> <li> Les bâtiments font une énorme différence sur la portée. Même s'il est mentionné que la portée peut atteindre quelques kilomètres, ne vous attendez pas à plus de 500 mètres en milieu urbain dans le meilleur des cas. </li> <li> Des bâtiments en béton ou des murs en briques ont un impact significatif sur la portée également. Certains de mes capteurs ne peuvent pas atteindre plus de 200 mètres. À l'inverse, ma meilleure portée est de 450 mètres avec une vue directe à travers une fenêtre. Sachant cela, une passerelle (gateway) extérieure avec un accès à un toit est probablement la meilleure option pour avoir une bonne portée sur 360 degrés. </li> <li> Si vous êtes proches d'un lieu de travail qui utilise une radio pour communiquer (comme le bâtiment des travaux publics à Magog), cela peut brouiller énormément le signal. C'est pour cette raison qu'entre 7&nbspAM et 5&nbspPM, mes lectures ne sont pas constantes. Je suis présentement en train d'essayer de trouver une solution à ce problème. </li> </ul> </p>

source: Summary and full report of the Magog climate change adaptation plan
fr: Sommaire et rapport complet pour le plan d'adaptation aux changements climatiques de Magog.

source: Magog's CCAP
fr: PACC de Magog

# title
source: Magog's climate change adaptation plan
fr: Plan d'adaptation aux changements climatiques de Magog

source: Summary
fr: Sommaire
