Repository: JNCote89/geoadaptation-production
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fr

source: The production of the climate change adaptation plan for Magog result from the 241-2020 resolution adopt unanimously by the municipal council on June 1st 2020. The latter wish to follow up to reports from the Federation of Canadian Municipalities and the Union des Municipalités du Québec on the climate question. Both reports are unanimous, the inaction towards this challenge is <span class="h-text">expensive</span> and put at <span class="h-text">risk public health and infrastructure</span>. The conclusions of this plan and the approval of its execution have been endorsed unanimously by the municipal council with the 472-2020 resolution. </p> <p> The consultation of various stakeholders confirmed the significance of climate change adaptation. An online survey who gathers more than 300 answers from citizens reveals that <span class="h-text">97 %%</span> of them wish that adaptation strategies are put in place. The <span class="h-text">protection of natural environment</span> was the most popular option with 82 %% of support. The consulted environmental organizations also raise the importance of <span class="h-text">protecting natural environment and biodiversity</span>. The consulted divisions within the city underlined the anticipate increased cost associated with climate change but was unable to quantify it due to a lack of data. </p> <p> Magog city is already affected by an <span class="h-text">increase in temperature</span>. About the <span class="h-text">third of its population</span> lives in an <span class="h-text">urban heat island</span>, which amplifies the problem. Regarding precipitation, the annual quantity only increases slightly, but the number of <span class="h-text">heavy precipitations is increasing</span>. <span class="h-text">More than 8&nbsp%% of the real estate assessment is in a flood zone</span>, which makes it a current challenge. <span class="h-text">Droughts</span> and <span class="h-text">freeze-thaw cycle</span> are also a problem. <span class="h-text">Lyme disease</span> and <span class="h-text">ragweed</span> is also significant in the region. </p> <p> All the current tendency will be exacerbated in the future. For instance, by 2050, the <span class="h-text">maximal temperature will increase by 3&nbsp°C</span> if the trend continues. The peak flow for the Magog river will increase by 7&nbsp%% and the minimum flow will <span class="h-text">decrease by 42&nbsp%%</span>, which means a wide variety in the precipitation scheme that will require a good management of droughts and heavy precipitations. </p> <p> Among the evaluated adaptation strategies, there was the protection of wetlands and natural environments, the protection of biodiversity, the greening of urban spaces, the continuation of the protection of riparian buffer stripes, the promotion of green infrastructure, the use of white roofs, the optimization of rainwater management, the continuation of the program to monitor the conformity of the rain gutter and the sampling of water streams, as well as improving the culvert management and the initiatives to save drinkable water. </p> <p> A hierarchy of those strategies was necessary. Their assessment is usually done with a risk matrix. However, this traditional method was not deem discriminating enough and too broad to take well-informed decisions. The use of a vulnerability assessment was favoured. The formula V&nbsp=&nbspS&nbsp–&nbspAC was used, where V is the vulnerability, S the sensitivity and AC the adaptive capacity. With this approach, it was possible to include the budget, the strategy efficacy and the number of people affected by the strategy in the adaptive capacity variable. </p> <p> <span class="h-text">The most effective strategy according to this assessment is the protection of wetlands, riparian buffer stripe, biodiversity and natural environment.</span> All the other strategies have their uses, but they are either costly to deploy on the whole territory (green infrastructure and grey infrastructure) or have a more limited effectiveness in regards of co-benefits (gutter conformity that manages only rainwater, etc.). The adaptation plan has objectives to reach by 2030 to become a more resilient city to climate change and to hazards in general. In order to reach those objectives, the city must, among other things: <ul> <li> <span class="h-text">Include every stakeholder</span> in the adaptation strategies, with the citizen at the heart of its preoccupations. </li> <li> Understand the sanitary and economic impacts of climate change, and the urge to act. </li> <li> <span class="h-text">Acknowledge that environmental externalities cause economic losses </span>in the long run, especially in a context of climate change. Therefore, all development projects must consider environmental externalities compared to anticipate economic gains to make sure of the profitability of those. </li> <li> <span class="h-text">Prioritize natural environment protection, and especially wetlands, </span> because this measure is the most advantageous to adapt to climate change and decrease its sanitary impacts. </li> <li> Publish the technical document on climate change adaptation to contribute to the advancement of knowledge and to help other municipalities. In addition, vulgarize information must be communicated to the public. </li> <li> <span class="h-text">Improve data collection in the field and encouraged scientific research </span> on climate change in order to take well-informed decision that rely on the best evidence-based fact as possible. </li> <li> Establish a strategy to integrate green infrastructure in the city development. </li> </ul>
fr: L’élaboration du plan d’adaptation aux changements climatiques de la Ville de Magog découle de la résolution 241-2020 adoptée à l’unanimité par le conseil municipal le 1er juin 2020. Ce dernier souhaite donner suite aux rapports produits par la Fédération canadienne des municipalités et l’Union des municipalités du Québec sur la question climatique pour les municipalités. Les deux rapports sont unanimes, l’inaction face à ce défi coûte <span class="h-text">cher</span> et met en péril <span class="h-text">la santé publique et les infrastructures</span>. Les conclusions de ce plan d’adaptation et l’approbation de sa mise en œuvre ont été entérinées à l’unanimité le 2 novembre 2020 par le conseil municipal en vertu de la résolution 472-2020. </p> <p> La consultation de diverses parties prenantes a confirmé l'importance de l’adaptation aux changements climatiques. Un sondage en ligne auquel plus de 300 citoyens ont participé a révélé que <span class="h-text">97 %%</span> d’entre eux souhaitent que des mesures d’adaptation soient entreprises. La <span class="h-text">protection des milieux naturels</span> vient en tête de liste avec 82 %% d’appuis. Les organismes environnementaux consultés ont également soulevé l’importance de la <span class="h-text">protection des milieux naturels et de la biodiversité</span>. La consultation des différentes divisions de la Ville a fait ressortir l’augmentation anticipée des coûts, mais aussi l’incapacité à bien quantifier le phénomène pour l’ensemble des services municipaux à cause d’un manque de données. </p> <p>La Ville de Magog subit déjà une tendance à la <span class="h-text">hausse des températures</span>. Environ le <span class="h-text">tiers de sa population</span> réside dans un <span class="h-text">ilot de chaleur</span>, ce qui amplifie la problématique. En ce qui concerne les précipitations, la quantité totale annuelle connaît une légère augmentation, mais le nombre d’épisodes de <span class="h-text">pluie intense est à la hausse</span>. <span class="h-text">Plus de 8 %% de la valeur foncière de la Ville</span> se situe en zone inondable, ce qui en fait un enjeu actuel. Il en va de même pour les <span class="h-text">épisodes de sécheresse</span> et <span class="h-text">les cycles de gel et dégel</span> qui occasionnent des problèmes en période hivernale. La présence de la <span class="h-text">maladie de Lyme</span> et de <span class="h-text">l’herbe à poux</span> est significative sur le territoire. </p> <p> Toutes les tendances climatiques actuelles seront exacerbées dans le futur. Par exemple, d’ici 2050, la <span class="h-text">température maximale estivale augmentera de 3 °C</span> si la tendance se maintient. Les débits de crues maximaux pour la rivière Magog augmenteront d’environ 7 %% et les <span class="h-text">débits minimaux diminueront de 42 %%</span>, ce qui suggère une forte variabilité dans les précipitations qui nécessiteront une bonne gestion des périodes de sécheresse et de pluie intense. </p> <p>Parmi les stratégies d’adaptation évaluées, il y a notamment la protection des milieux humides et naturels, la protection de la biodiversité, la revégétalisation du périmètre urbain, la poursuite du programme de protection des bandes riveraines, la promotion des infrastructures vertes, l’utilisation de toits blancs, l’optimisation de la gestion des eaux pluviales, la poursuite du programme de débranchement des gouttières et d'échantillonnage des cours d'eau, ainsi que l’amélioration de la gestion des ponceaux et des initiatives d’économie d’eau potable. </p> <p>Une hiérarchisation de ces différentes stratégies est nécessaire. Leur évaluation se fait habituellement en utilisant une matrice de risque. Cette méthode traditionnelle a été jugée peu discriminante et trop générale pour bien orienter les décisions. L’utilisation d’un calcul de vulnérabilité a été privilégiée selon la formule V = S – CA où V est la vulnérabilité, S la sensibilité et CA la capacité d’adaptation. Ainsi, il fut possible d’intégrer les notions de budget, d’efficacité des mesures et de nombre de personnes incluses par les mesures dans la variable capacité d’adaptation. </p> <p> <span class="h-text">Les mesures les plus efficaces selon ce calcul sont la protection des milieux humides, des bandes riveraines, de la biodiversité et des milieux naturels.</span> Toutes les autres mesures ont leur place, mais elles sont très onéreuses à déployer sur l’ensemble du territoire (infrastructures vertes et infrastructures grises) ou possèdent une efficacité plus limitée en termes de co-bénéfices (débranchement des gouttières qui ne s’attaque qu’à la gestion des eaux pluviales, etc.). Le plan d’adaptation contient des objectifs à atteindre d’ici 2030 afin de tenir compte de tous ces éléments pour obtenir à terme une ville plus résiliente aux changements climatiques et aux aléas en général. Afin d’atteindre ces objectifs, la Ville doit notamment : <ul> <li> <span class="h-text">Intégrer toutes les parties prenantes</span> dans l’élaboration des stratégies d’adaptation, avec le citoyen au cœur des préoccupations. </li> <li> Comprendre les impacts sanitaires et économiques des changements climatiques, ainsi que l’urgence d’agir.</li> <li> <span class="h-text">Reconnaître que les externalités environnementales entrainent des pertes économiques</span> à long terme, surtout en contexte de changements climatiques. Par conséquent, tous les projets doivent tenir compte des externalités environnementales par rapport aux gains économiques anticipés afin de s’assurer de la rentabilité de ceux-ci. </li> <li> <span class="h-text">Prioriser la protection des milieux naturels et plus particulièrement les milieux humides</span>, car cette mesure est la plus avantageuse pour s’adapter aux changements climatiques et atténuer les impacts sanitaires. </li> <li> Diffuser le document technique sur l’adaptation aux changements climatiques pour contribuer à l’avancement des connaissances et aider les autres municipalités. De plus, il faut communiquer à la population l’information scientifique vulgarisée. </li> <li> <span class="h-text">Améliorer la collecte de données sur le terrain et encourager la recherche scientifique </span> sur les changements climatiques afin de prendre des décisions qui s’appuient sur les meilleures données probantes possible. </li> <li>Établir une stratégie afin d’intégrer les infrastructures vertes dans le développement de la Ville. </li> </ul>

source: A big thanks to Magog City and everyone who works there. This project would not have been possible without their massive support.
fr: Un gros merci à la Ville de Magog et tous ceux qui y oeuvrent. Ce projet n'aurait pas été possible sans votre énorme soutien.

source: Magog, Université de Sherbrooke, climate change, vulnerability, sensitivity, adaptive capacity, adaptation, geoadaptation, geomatic, GIS, public health, urban heat island, Espace Saint-Luc
fr: Magog, Université de Sherbrooke, changements climatiques, vulnérabilité, sensibilité, capacité d'adaptation, adaptation, géoadaptation, géomatique, SIG, santé publique, ilot de chaleur, Espace Saint-Luc

source: Overview of the urban heat island monitoring project in Magog at Espace Saint-Luc
fr: Aperçu du projet de suivi des ilots de chaleur à l'Espace Saint-Luc de Magog

source: UHI monitoring
fr: Suivi IDC

source: Monitoring dashboard
fr: Tableau de bord de suivi

source: The dashboard and the carousel for the site photos require JavaScript to work. Please, turn it on if you want to navigate on this page.
fr: Le tableau de bord et le carroussel pour les photos du site requiert JavaScript pour fonctionner. SVP, veuillez l'activer si vous désirez naviguer sur cette page.

source: e
fr: f

source: Please select a date between %(first_day)s and %(last_day)s
fr: SVP veuillez entrer une date entre le %(first_day)s et le %(last_day)s

source: Colour
fr: Couleur

source: Opacity
fr: Opacité

source: Loading layer
fr: Téléchargement de la couche

source: Temperature of each area for the selected layer (number of sensors)
fr: Température de chaque zone de la couche sélectionnée (nombre de capteurs)

source: <li >Select a date and a time in the bar above the map. The default value is the latest temperature sent by the sensors.</li> <li>If the time you want isn't available, it might be due to a sensor failure. Look at the
fr: <li >Sélectionnez une date et une heure sur la barre au-dessus de la carte. La valeur par défaut est la dernière température envoyée par les capteurs.</li> <li> Si la plage horaire que vous souhaitez consulter n'est pas disponible, cela peut être dû à un problème de capteurs. Regardez la section

source: section for more info.</li> <li>The colour and the opacity is only for the visual effect, it doesn't change the values or the analysis.</li> <li>You can toggle the layers on and off with the icon in the top right corner of the map.</li> <li>You can zoom in and out of the map with the wheel of your mouse or the icon in the top left corner of the map.</li>
fr: pour plus d'information. </li> <li>La couleur et l'opacité ne sont que pour le rendu visuel, ils n'affectent pas les valeurs ou les analyses.</li> <li> Vous pouvez ajouter ou retirer des couches avec l'icône en haut à droite de la carte</li> <li>Vous pouvez ajuster le zoom avec la roulette de la souris ou avec l'icône en haut à gauche de la carte</li>

source: Hourly max T
fr: T max horaire

source: Hourly avg T
fr: T moy horaire

source: Daily max T
fr: T max quotidien

source: Daily avg T
fr: T moy quotidien

source: Help
fr: Aide

source: This monitoring project, financed by Climat Municipalité 2, is part of the greening of the
fr: Le projet de suivi, financé par Climat Municipalité 2, fait partie du projet de verdissement du

source: 520 rue Saint-Luc in Magog
fr: 520 rue Saint-Luc à Magog

source: The first phase that unfolds in 2021 consists to decontaminate the site, carry out public consultations and work with various stakeholders to create the development plans. </p> <p> If everything goes well, works should start in 2022 and end by 2023. A significant tree plantation covering <span class="h-text">20 000 m<sup>2</sup></span> will provide a cooling island directly on site and in the nearing neighborhood. </p> <p> In order to measure with precision this cooling effect, 10 sensors using the
fr: La première phase du projet qui se déroule en 2021 consiste à décontaminer le site, effectuer des consultations publiques et travailler avec diverses parties prenantes pour élaborer les plans d'aménagement. </p> <p> Si tout se déroule bien, les travaux devraient s’amorcer en 2022 et se terminer en 2023. Une importante plantation d’arbres sur plus de <span class="h-text"><b>20 000 m<sup>2</sup></b></span> offrira un ilot de fraicheur aux citoyens directement sur le site, mais aussi dans les quartiers environnants. </p> <p> Afin de mesurer avec précision cet effet de refroidissement, 10 capteurs qui utilisent la technologie

source: technology have been installed in various places to provide real-time data that you can look at in the dashboard above. This project will continue beyond the end of the works, because as trees will mature, the cooling effect should increase. Researchers from Université de Sherbrooke, will make an in-depth analysis of that data. Pictures of the site evolution are below.
fr: ont été installés à divers endroits stratégiques. Ces capteurs donnent une lecture en temps réel de la température observable dans le tableau de bord ci-haut. Le projet de suivi se poursuivra au-delà de la fin des travaux, puisque plus les arbres gagneront en maturité, plus le pouvoir rafraichissant devrait s’accroître. Des chercheurs de l’Université de Sherbrooke analyseront ensuite ces données en profondeur. Des photos de l’évolution du site sont disponibles ci-dessous.

source: Spring 2021
fr: Printemps 2021

source: South Area
fr: Zone sud

source: Before the start of the project
fr: Avant le début du projet

source: North Area
fr: Zone nord

source: West Area
fr: Zone ouest

source: East Area
fr: Zone est

source: Summer 2021 summary results
fr: Résultats sommaires pour l’été 2021

source: In order to evaluate the urban heat island phenomenon in the neighborhood, the temperature from the sensors have been compared to the
fr: Afin d’évaluer le phénomène d’ilots de chaleur dans le quartier, les températures des capteurs ont été comparées avec la

source: Environment Canada (EC) meteorological station
fr: station météorologique d’Environnement Canada (EC)

source: located near Lac Memphrémagog.
fr: située aux abords du lac Memphrémagog.

source: The highest temperature registered by a sensor was 39.7 °C and the biggest difference between a sensor and the EC station was 11.7 °C. In average, the mean temperature difference between the highest value of a sensor and the EC station during the day (7 to 19h) was 4.9 °C and the lowest one was 1.3 °C. For the afternoon (12 to 17h), those numbers were respectively of 5.5 °C and 2.1 °C. The table below summarize the result for each study zone.
fr: La température la plus élevée enregistrée par un capteur a été de 39,7 °C et la plus grande différence entre un capteur et la station d’EC a été de 11,7 °C. En moyenne, la différence de température moyenne la plus élevée entre un capteur et la station d’EC durant le jour (7 à 19h) était de 4,9 °C et la différence la moins élevée affichait 1,3 °C. Pour l’après-midi (12 à 17h), ces chiffres étaient respectivement de 5,5 °C et de 2,1 °C. Le tableau ci-dessous résume les statistiques pour chaque zone à l’étude.

source: Mean temperature difference between the EC station and the sensors
fr: Différence de température moyenne entre la station d'EC et les capteurs

source: Day (7 to 19h)
fr: Jour (7 à 19h)

source: Afternoon (12 to 17h)
fr: Après-midi (12 à 17h)

source: Zone between 0 and 100 metres
fr: Zone entre 0 et 100 mètres

source: Zone between 100 and 200 metres
fr: Zone entre 100 et 200 mètres

source: Zone between 200 and 300 metres
fr: Zone entre 200 et 300 mètres

source: Zone between 300 and 400 metres
fr: Zone entre 300 et 400 mètres

source: All sensors
fr: Tous les capteurs

source: Maps below have been produced by interpolating the difference between the sensor’s temperature and the EC station’s temperature by using the cubic spline method. The exercise has been done for different base temperatures registered at the EC station (20 °C, 25 °C, 30 °C and the worst case of the summer with a temperature difference of 11.7 °C). It’s possible to notice a trend that shows the higher the temperature, the more significant the difference. Hence in a climate change future where temperatures will be higher, it is crucial to mitigate the urban heat island effect, which is the goal of this greening project.
fr: Des cartes ont été produites en interpolant la différence entre la température des capteurs et la température des stations d’EC avec la méthode cubic spline. Cet exercice a été fait à partir de différentes températures de base à la station d’EC (20 °C, 25 °C, 30 °C et le pire cas de l’été avec une différence de température de 11,7 °C). Il est possible d’observer une tendance qui montre que plus la température est élevée, plus la différence est significative. Par conséquent, dans un futur avec des changements climatiques importants, il sera crucial d’atténuer le phénomène d’ilots de chaleur, ce que vise ce projet de revégétalisation.

source: EC station at 20 °C
fr: Station d'EC à 20 °C

source: Summer of 2021
fr: Été de 2021

source: EC station at 25 °C
fr: Station d'EC à 25 °C

source: EC station at 30 °C
fr: Station d'EC à 30 °C

source: Difference of 11.7 °C with the EC station
fr: Différence de 11,7 °C avec la station d'EC

source: Partner organizations for this project
fr: Organismes partenaires pour ce projet

source: A big thanks to Magog City and everyone who works there. This project would not have been possible without their tremendous support.
fr: Un énorme merci à la Ville de Magog et tous ceux qui y oeuvrent. Ce projet n'aurait pas été possible sans leur immense soutien.

source: This project has received a grant from Climat municipalités - Phase 2 from the Quebec government and meet the objectives for the 2030 Plan for a Green Economy.
fr: Ce projet bénéficie d'une aide financière du gouvernement du Québec tirée du programme Climat municipalités - Phase 2 et rejoint les objectifs du Plan pour une économie verte 2030.

source: Proof of Concept Using AI and GIS with Open Data on COVID
fr: Preuve de concept de l'utilisation de l'IA et des SIG avec des données ouvertes sur la COVID

source: This proof of concept uses the random forest classification algorithm to illustrate the potential of an approach combining artificial intelligence and geographic information systems (GIS) for public health issues. The result is far from perfect, because the open data on COVID that fed the AI model lack volume and precision. Explanations will be provided to underline the problems and the corrective measures to include in a complete research project.
fr: Cette preuve de concept utilise l'algorithme de classification Random Forest pour illustrer le potentiel d’une approche combinant l’intelligence artificielle (IA) et les systèmes d’information géographique (SIG) pour des problématiques de santé publique. Le résultat est loin d’être parfait, car les données ouvertes sur la COVID qui ont alimenté le modèle manquaient de volume et de précision. Des explications seront fournies pour souligner les problématiques et les correctifs à apporter pour un projet de recherche complet.

source: Those preliminary results and the
fr: Ces résultats préliminaires et l’étude de

source: study can lead us to believe that developing this approach could be beneficial for public health. However, this technique is not used a lot in the scientific literature, so it remains a vast field to explore.
fr: laisse présager que cette approche pourrait être bénéfique pour la santé publique. Cependant, cette technique est très peu utilisée dans la littérature scientifique, alors cela demeure un vaste champ à explorer.
